#include <bits/stdc++.h>
using namespace std;

#define P	0	//休止符
#define M1	1	//M表示中音
#define M2	2
#define M3	3
#define M4	4
#define M5	5
#define M6	6
#define M7	7
#define H1	8	//H表示高音
#define H2  9
#define H3	10
#define H4	11
#define H5	12
#define H6	13
#define H7	14
#define STOP -1
#define BLK -2
int Music[][2] = {	//后一位表示时长，1为半拍
	{M3,4},{M2,2},{M1,4},{M2,2},{M3,3},{M4,1},{M3,2},{M2,4},{P,2},{BLK,1},
	{M3,4},{M2,2},{M1,4},{M2,2},{M3,3},{M4,1},{M3,2},{M2,4},{P,2},{BLK,1},
	{M3,4},{M2,2},{M1,4},{M2,2},{M3,3},{M4,1},{M3,2},{M2,4},{P,2},{BLK,1},
	{M3,4},{M2,2},{M1,4},{M2,2},{M3,3},{M4,1},{M3,2},{M2,4},{BLK,1},
	{M1,1},{M2,1},{M3,2},{M3,2},{M2,2},{M4,2},{M3,2},{M2,2},{M2,2},{M2,2},{M1,1},{M1,1},{M4,2},{M3,2},{M2,2},{M2,4},{M1,1},{M2,1},{M3,6},{P,6},{BLK,1},
		//悴んだ心 ふるえる眼差し 世界で
	{M3,2},{M5,2},{H1,1},{H1,1},{M7,4},{H1,2},{M7,4},{H1,2},{M7,1},{M6,1},{M5,2},{P,2},{BLK,1},
		//僕は ひとりぼっちだった
	{M5,2},{M2,2},{M4,2},{M4,4},{M3,2},{M3,2},{P,2},{P/*L5*/,2},{M4,2},{M3,2},{M2,2},{M3,4},{M5,2},{M1,6},{BLK,1},
		//散ることしか知らない春は
	{P,4},{M1,2},{M2,2},{M1,3},{M1,1},{M1,2},{M5,2},{M1,2},{M4,4},{M3,2},{M2,4},{M1,2},{M1,6},{BLK,1},
		//毎年冷たくあしらう
	{P,4},{M1,1},{M2,1},{M3,2},{M3,2},{M2,2},{M4,2},{M3,2},{M2,2},{M2,2},{M2,2},{M1,1},{M1,1},{M4,2},{M3,2},{M2,2},{M2,4},{M1,1},{M2,1},{M3,6},{P,6},{BLK,1},
		//暗がりの中 一方通行に ただた だ
	{M3,2},{M5,2},{H1,2},{M7,4},{H1,2},{M7,4},{H1,2},{M7,1},{M6,1},{M5,2},{P,2},{BLK,1},
		//言葉を書き殴って
	{M5,2},{M2,2},{M4,2},{M4,4},{M3,2},{M3,2},{P,2},{P/*L5*/,2},{M4,2},{M3,2},{M2,2},{M3,4},{M5,2},{M1,10},{M1,1},{M1,1},{M2,2},{M1,2},{P,2},{BLK,1},
		//期待するだけ むなしいと分かっていても
	{M1,2},{M5,2},{M1,2},{M4,2},{M4,1},{M4,1},{M3,1},{M2,1},{M2,4},{M1,2},{M1,6},{P,6},{BLK,1},
		//救いを求め続けた
	{M6,2},{M5,2},{M5,2},{M5,2},{M4,2},{M4,2},{M3,2},{M2,2},{M2,2},{M2,4},{BLK,1},
		//せつなくて いとおしい
	{M5,2},{M5,2},{M4,1},{M4,1},{M4,2},{M4,2},{M3,2},{M2,2},{M2,4},{M1,1},{P/*L7*/,1},{M1,4},{P,2},{BLK,1},
		//今ならば 分かる気がする
	{M6,2},{M5,2},{M5,2},{M5,2},{M4,2},{M4,2},{M3,2},{M2,2},{M2,2},{M2,4},{BLK,1},
		//しあわせで くるおしい
	{M2,2},{M3,2},{M3,1},{M3,1},{M3,1},{M3,1},{M3,2},{M2,2},{M3,2},{H2,4},{H1,2},{H1,2},{P,2},{BLK,1},
		//あの日泣けなかった僕を
	{H1,2},{M7,4},{M6,2},{M6,6},{P,4},{M6,2},{M6,2},{M5,2},{M4,1},{M4,1},{M4,6},{M3,1},{M4,1},{M5,10},{P,6},{BLK,1},
		//光は やさしく連れ立つよ
	{M3,1},{M2,1},{M3,1},{M2,1},{M3,1},{M4,1},{M5,4},{M4,1},{M5,1},{M6,4},{M6,1},{M7,1},{H1,2},{P,2},{BLK,1},
		//雲間をぬって きらりきらり
	{H2,1},{H1,1},{M5,4},{M1,2},{M5,2},{M4,2},{M3,2},{M3,4},{M3,1},{M3,1},{M5,4},{P,2},{BLK,1},
		//心満たしては 溢れ
	{M3,1},{M2,1},{M3,1},{M2,1},{M3,1},{M4,1},{M5,4},{M4,1},{M5,1},{M6,4},{M6,1},{M7,1},{H1,2},{P,2},{BLK,1},
		//いつしか頬を きらりきらり
	{H1,1},{H3,2},{H3,2},{P,1},{H2,1},{H4,2},{H3,2},{H2,2},{H2,3},{H1,1},{H1,1},{M7,1},{H1,2},{P,2},{BLK,1},
		//熱く 熱く濡らしてゆく
	{M5,1},{H1,1},{H2,4},{H1,2},{H1,2},{P,2},{M5,2},{H2,4},{H1,2},{H1,2},{P,2},{BLK,1},
		//君の手は どうして
	{M5,1},{H1,1},{H2,4},{H1,2},{H1,2},{P,2},{M5,1},{H1,1},{H2,3},{H3,1},{H2,2},{H1,2},{P,2},{BLK,1},
		//こんなにも温かいの？
	{H1,2},{H1,4},{M6,2},{M6,4},{M5,2},{M5,4},{M4,2},{M4,2},{M3,2},{M2,2},{M3,6},{P,6},{M3,2},{M4,2},{M3,2},{M4,2},{M3,2},{M2,2},{M1,6},{BLK,1},
		//ねぇお願い どうかこのまま 離さないでいて
	{STOP,1}
};

vector<int> siz;

int main(){
	int cnt = 0,l_cnt = 0;
	while (Music[cnt][0] != STOP){
		if (Music[cnt][0] == BLK){
			siz.push_back(cnt - l_cnt);
			l_cnt = cnt;
		}
		cnt++;
	}
	
	cout<<"DATA "<<siz.size()<<endl;
	int lst = 0;
	for (int i=0;i<siz.size();i++){
		cout<<"DATA "<<(Music[lst][0] != BLK?siz[i]:siz[i]-1)<<endl<<"DATA ";
		for (int j = lst;j <= lst+siz[i]-2;j++)
			if (Music[j][0] != BLK)
				cout<<Music[j][0]<<','<<Music[j][1]<<',';
		cout<<Music[lst+siz[i]-1][0]<<','<<Music[lst+siz[i]-1][1]<<endl;
		lst += siz[i];
	}
	return 0;
}
